Revit 2024 API
DetachFromCentralOption Enumeration
 Options for workset detachment behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum DetachFromCentralOption
Visual Basic
Public Enumeration DetachFromCentralOption
Visual C++
public enum class DetachFromCentralOption
Members
Member name | Description
DoNotDetach |  Do not detach the file being opened from its central file.
DetachAndPreserveWorksets |  Detach the file being opened from its central file.
DetachAndDiscardWorksets |  Detach the model being opened from its central model and discard worksets/worksharing.
ClearTransmittedSaveAsNewCentral |  After opening the transmitted, workshared model, immediately resave it with its current name and clear the transmitted flag.
See Also
Autodesk.Revit.DB Namespace